datomusic/duo-imxrt/brains2/components/audio/fsl_adapter_sai.c
    audioHandle = (hal_audio_state_t *)userData;

    if (NULL != audioHandle->callback)
    {
        audioHandle->callback(audioHandle, HAL_AudioGetStatus(status), audioHandle->callbackParam);
    }
}
#elif (defined(FSL_FEATURE_SOC_DMA_COUNT) && (FSL_FEATURE_SOC_DMA_COUNT > 0U))
static void HAL_AudioCallbackDMA(I2S_Type *base, sai_dma_handle_t *handle, status_t status, void *userData)
{
    hal_audio_state_t *audioHandle;

    assert(userData);

    audioHandle = (hal_audio_state_t *)userData;

    if (NULL != audioHandle->callback)
    {
        audioHandle->callback(audioHandle, HAL_AudioGetStatus(status), audioHandle->callbackParam);
    }
}
#else
#endif

static hal_audio_status_t HAL_AudioCommonInit(hal_audio_handle_t handle,
                                              const hal_audio_config_t *config,
                                              bool direction)
{
    hal_audio_state_t *audioHandle;
    sai_transceiver_t saiConfig;
    hal_audio_dma_config_t *dmaConfig;
    hal_audio_ip_config_t *featureConfig;
    DMA_Type *dmaBases[]    = DMA_BASE_PTRS;
    IRQn_Type txIrqNumber[] = I2S_TX_IRQS;
    IRQn_Type rxIrqNumber[] = I2S_RX_IRQS;
#if (defined(FSL_FEATURE_SOC_EDMA_COUNT) && (FSL_FEATURE_SOC_EDMA_COUNT > 0U))
    IRQn_Type dmaIrqNumber[][FSL_FEATURE_EDMA_MODULE_CHANNEL] = DMA_CHN_IRQS;
    edma_config_t audioDmaConfig;
    edma_channel_Preemption_config_t preemptionConfig;
#if (defined(FSL_FEATURE_SOC_DMAMUX_COUNT) && (FSL_FEATURE_SOC_DMAMUX_COUNT > 0U))
    DMAMUX_Type *dmaMuxBases[] = DMAMUX_BASE_PTRS;
    hal_audio_dma_mux_config_t *dmaMuxConfig;
#endif /* FSL_FEATURE_SOC_DMAMUX_COUNT */
#elif (defined(FSL_FEATURE_SOC_DMA_COUNT) && (FSL_FEATURE_SOC_DMA_COUNT > 0U))
    IRQn_Type dmaIrqNumber[][FSL_FEATURE_DMA_MODULE_CHANNEL] = DMA_CHN_IRQS;
#else
#endif /* FSL_FEATURE_SOC_EDMA_COUNT or FSL_FEATURE_SOC_DMA_COUNT */

#if (defined(FSL_FEATURE_SAI_HAS_FIFO_COMBINE_MODE) && (FSL_FEATURE_SAI_HAS_FIFO_COMBINE_MODE > 0U))
    uint32_t u32Temp;
    uint8_t lineNum;
#endif /* FSL_FEATURE_SAI_HAS_FIFO_COMBINE_MODE */
    uint8_t channelNum;

    assert(handle);
    assert(config);
    assert(config->dmaConfig);
    assert(config->ipConfig);
    /* If asserted, please check if the value of SAI_XFER_QUEUE_SIZE defined in the fsl_sai.h is modified.
       If modified, please modify the value of HAL_AUDIO_QUEUE_SIZE defined in the fsl_adapter_audio.h to be the same as
       SAI_XFER_QUEUE_SIZE. */
    assert(HAL_AUDIO_HANDLE_SIZE >= sizeof(hal_audio_state_t));
    assert(config->instance < ARRAY_SIZE(s_i2sBases));
    assert(config->dmaConfig->instance < ARRAY_SIZE(dmaBases));

    dmaConfig     = (hal_audio_dma_config_t *)config->dmaConfig;
    featureConfig = (hal_audio_ip_config_t *)config->ipConfig;
    audioHandle   = (hal_audio_state_t *)handle;

    assert(featureConfig->sai.lineMask != 0U);

    if (audioHandle->occupied != 0U)
    {
        return kStatus_HAL_AudioSuccess;
    }

    audioHandle->instance    = config->instance;
    audioHandle->dmaInstance = dmaConfig->instance;
    audioHandle->occupied    = 1;

    SAI_GetClassicI2SConfig(&saiConfig, (sai_word_width_t)config->bitWidth, kSAI_Stereo, featureConfig->sai.lineMask);

#if (defined(FSL_FEATURE_SAI_HAS_FIFO_COMBINE_MODE) && (FSL_FEATURE_SAI_HAS_FIFO_COMBINE_MODE > 0U))
    lineNum = 0;
    u32Temp = featureConfig->sai.lineMask;
    while (u32Temp > 0U)
    {
        u32Temp &= u32Temp - 1U;
        lineNum++;
    }

    if (lineNum > 1U)
    {
        saiConfig.fifo.fifoCombine = kSAI_FifoCombineModeEnabledOnWrite;
    }
#endif /* FSL_FEATURE_SAI_HAS_FIFO_COMBINE_MODE */

#if (defined(FSL_FEATURE_SAI_FIFO_COUNT) && (FSL_FEATURE_SAI_FIFO_COUNT > 1))
    if (config->fifoWatermark < (uint16_t)FSL_FEATURE_SAI_FIFO_COUNT)
    {
        saiConfig.fifo.fifoWatermark = (uint8_t)config->fifoWatermark;
    }
    else
    {
        saiConfig.fifo.fifoWatermark = (uint8_t)FSL_FEATURE_SAI_FIFO_COUNT - 1U;
    }
#endif /* FSL_FEATURE_SAI_FIFO_COUNT */

    if ((uint8_t)config->bclkPolarity == (uint8_t)kHAL_AudioSampleOnFallingEdge)
    {
        saiConfig.bitClock.bclkPolarity = kSAI_SampleOnFallingEdge;
    }
    else
    {
        saiConfig.bitClock.bclkPolarity = kSAI_SampleOnRisingEdge;
    }

    channelNum = (uint8_t)config->lineChannels;

    if (channelNum == (uint8_t)kHAL_AudioMono)
    {
        saiConfig.frameSync.frameSyncWidth = config->bitWidth >> 1U;
        saiConfig.serialData.dataWordNum   = 1U;
        channelNum                         = 1;
    }
    else if (channelNum < (uint8_t)kHAL_AudioStereo)
    {
        saiConfig.frameSync.frameSyncWidth  = config->bitWidth;
        saiConfig.serialData.dataWordNum    = 2U;
        saiConfig.serialData.dataMaskedWord = 0x1UL << channelNum;
        channelNum                          = 2;
    }
    else
    {
        saiConfig.frameSync.frameSyncWidth = config->bitWidth * channelNum >> 1U;
        saiConfig.serialData.dataWordNum   = channelNum;
    }

    if ((uint8_t)featureConfig->sai.syncMode == (uint8_t)kHAL_AudioSaiModeAsync)
    {
        saiConfig.syncMode = kSAI_ModeAsync;
    }
    else
    {
        saiConfig.syncMode = kSAI_ModeSync;
    }

    switch (config->msaterSlave)
    {
        case kHAL_AudioMaster:
            saiConfig.masterSlave = kSAI_Master;
            break;

        case kHAL_AudioSlave:
            saiConfig.masterSlave = kSAI_Slave;
            break;

        case kHAL_AudioBclkMasterFrameSyncSlave:
            saiConfig.masterSlave = kSAI_Bclk_Master_FrameSync_Slave;
            break;

        case kHAL_AudioBclkSlaveFrameSyncMaster:
            saiConfig.masterSlave = kSAI_Bclk_Slave_FrameSync_Master;
            break;

        default:
            assert(false);
            break;
    }

    switch (config->dataFormat)
    {
        case kHAL_AudioDataFormatI2sClassic:
            saiConfig.frameSync.frameSyncEarly    = true;
            saiConfig.frameSync.frameSyncPolarity = kSAI_PolarityActiveLow;
            break;

