datomusic/duo-imxrt/brains2/components/audio/fsl_adapter_sai.c
        case kHAL_AudioDataFormatLeftJustified:
            saiConfig.frameSync.frameSyncEarly    = false;
            saiConfig.frameSync.frameSyncPolarity = kSAI_PolarityActiveHigh;
            break;

        case kHAL_AudioDataFormatRightJustified:
            saiConfig.frameSync.frameSyncEarly    = false;
            saiConfig.frameSync.frameSyncPolarity = kSAI_PolarityActiveHigh;
            break;

        case kHAL_AudioDataFormatDspModeA:
            saiConfig.frameSync.frameSyncEarly    = true;
            saiConfig.frameSync.frameSyncPolarity = kSAI_PolarityActiveHigh;
            if ((uint8_t)config->frameSyncWidth == (uint8_t)kHAL_AudioFrameSyncWidthOneBitClk)
            {
                saiConfig.frameSync.frameSyncWidth = 1;
            }
            else if ((uint8_t)config->frameSyncWidth == (uint8_t)kHAL_AudioFrameSyncWidthPerWordWidth)
            {
                saiConfig.frameSync.frameSyncWidth = config->bitWidth;
            }
            else
            {
                /* no action */
            }
            break;

        case kHAL_AudioDataFormatDspModeB:
            saiConfig.frameSync.frameSyncEarly    = false;
            saiConfig.frameSync.frameSyncPolarity = kSAI_PolarityActiveHigh;
            if ((uint8_t)config->frameSyncWidth == (uint8_t)kHAL_AudioFrameSyncWidthOneBitClk)
            {
                saiConfig.frameSync.frameSyncWidth = 1;
            }
            else if ((uint8_t)config->frameSyncWidth == (uint8_t)kHAL_AudioFrameSyncWidthPerWordWidth)
            {
                saiConfig.frameSync.frameSyncWidth = config->bitWidth;
            }
            else
            {
                /* no action */
            }
            break;

        default:
            assert(false);
            break;
    }

    if (s_i2sOccupied[audioHandle->instance] == 0U)
    {
        SAI_Init(s_i2sBases[audioHandle->instance]);
    }
    s_i2sOccupied[audioHandle->instance]++;

#if (defined(FSL_FEATURE_SOC_EDMA_COUNT) && (FSL_FEATURE_SOC_EDMA_COUNT > 0U))
#if (defined(FSL_FEATURE_SOC_DMAMUX_COUNT) && (FSL_FEATURE_SOC_DMAMUX_COUNT > 0U))
    assert(dmaConfig->dmaMuxConfig);

    dmaMuxConfig = (hal_audio_dma_mux_config_t *)dmaConfig->dmaMuxConfig;

    audioHandle->dmaMuxInstance = dmaMuxConfig->dmaMuxConfig.dmaMuxInstance;

#if (defined(HAL_AUDIO_DMA_INIT_ENABLE) && (HAL_AUDIO_DMA_INIT_ENABLE > 0U))
    if (s_dmaMuxOccupied[audioHandle->dmaMuxInstance] == 0U)
    {
        DMAMUX_Init(dmaMuxBases[audioHandle->dmaMuxInstance]);
    }
    s_dmaMuxOccupied[audioHandle->dmaMuxInstance]++;
#endif /* HAL_AUDIO_DMA_INIT_ENABLE */

    DMAMUX_SetSource(dmaMuxBases[audioHandle->dmaMuxInstance], dmaConfig->channel,
                     dmaMuxConfig->dmaMuxConfig.dmaRequestSource);

    DMAMUX_EnableChannel(dmaMuxBases[audioHandle->dmaMuxInstance], dmaConfig->channel);
#endif /* FSL_FEATURE_SOC_DMAMUX_COUNT */

    EDMA_GetDefaultConfig(&audioDmaConfig);

#if (defined(HAL_AUDIO_DMA_INIT_ENABLE) && (HAL_AUDIO_DMA_INIT_ENABLE > 0U))
    if (s_dmaOccupied[dmaConfig->instance] == 0U)
    {
        EDMA_Init(dmaBases[dmaConfig->instance], &audioDmaConfig);
    }
    s_dmaOccupied[dmaConfig->instance]++;
#endif /* HAL_AUDIO_DMA_INIT_ENABLE */

    NVIC_SetPriority((IRQn_Type)dmaIrqNumber[dmaConfig->instance][dmaConfig->channel], HAL_AUDIO_ISR_PRIORITY);
    EDMA_CreateHandle(&audioHandle->dmaHandle, dmaBases[dmaConfig->instance], dmaConfig->channel);

#if (defined(FSL_FEATURE_EDMA_HAS_CHANNEL_MUX) && (FSL_FEATURE_EDMA_HAS_CHANNEL_MUX > 0U))
    assert(dmaConfig->dmaChannelMuxConfig);

    EDMA_SetChannelMux(
        dmaBases[dmaConfig->instance], dmaConfig->channel,
        ((hal_audio_dma_channel_mux_config_t *)dmaConfig->dmaChannelMuxConfig)->dmaChannelMuxConfig.dmaChannelMux);
#endif /* FSL_FEATURE_EDMA_HAS_CHANNEL_MUX */

    if ((uint8_t)kHAL_AudioDmaChannelPriorityDefault != (uint8_t)dmaConfig->priority)
    {
        preemptionConfig.enableChannelPreemption = dmaConfig->enablePreemption;
        preemptionConfig.enablePreemptAbility    = dmaConfig->enablePreemptAbility;
        preemptionConfig.channelPriority         = (uint8_t)dmaConfig->priority;
        EDMA_SetChannelPreemptionConfig(dmaBases[dmaConfig->instance], dmaConfig->channel, &preemptionConfig);
    }

    if (direction)
    {
        SAI_TransferTxCreateHandleEDMA(s_i2sBases[audioHandle->instance], &audioHandle->xferDmaHandle,
                                       HAL_AudioCallbackEDMA, audioHandle, &audioHandle->dmaHandle);
        SAI_TransferTxSetConfigEDMA(s_i2sBases[audioHandle->instance], &audioHandle->xferDmaHandle, &saiConfig);
    }
    else
    {
        SAI_TransferRxCreateHandleEDMA(s_i2sBases[audioHandle->instance], &audioHandle->xferDmaHandle,
                                       HAL_AudioCallbackEDMA, audioHandle, &audioHandle->dmaHandle);
        SAI_TransferRxSetConfigEDMA(s_i2sBases[audioHandle->instance], &audioHandle->xferDmaHandle, &saiConfig);
    }

#elif (defined(FSL_FEATURE_SOC_DMA_COUNT) && (FSL_FEATURE_SOC_DMA_COUNT > 0U))
#if (defined(HAL_AUDIO_DMA_INIT_ENABLE) && (HAL_AUDIO_DMA_INIT_ENABLE > 0U))
    if (s_dmaOccupied[dmaConfig->instance] == 0U)
    {
        DMA_Init(dmaBases[dmaConfig->instance]);
    }
    s_dmaOccupied[dmaConfig->instance]++;
#endif /* HAL_AUDIO_DMA_INIT_ENABLE */

    NVIC_SetPriority((IRQn_Type)dmaIrqNumber[dmaConfig->instance][dmaConfig->channel], HAL_AUDIO_ISR_PRIORITY);
    DMA_CreateHandle(&audioHandle->dmaHandle, dmaBases[dmaConfig->instance], dmaConfig->channel);

    if (direction)
    {
        SAI_TransferTxCreateHandleDMA(s_i2sBases[audioHandle->instance], &audioHandle->xferDmaHandle,
                                      HAL_AudioCallbackDMA, audioHandle, &audioHandle->dmaHandle);
        SAI_TransferTxSetConfigDMA(s_i2sBases[audioHandle->instance], &audioHandle->xferDmaHandle, &saiConfig);
    }
    else
    {
        SAI_TransferRxCreateHandleDMA(s_i2sBases[audioHandle->instance], &audioHandle->xferDmaHandle,
                                      HAL_AudioCallbackDMA, audioHandle, &audioHandle->dmaHandle);
        SAI_TransferRxSetConfigDMA(s_i2sBases[audioHandle->instance], &audioHandle->xferDmaHandle, &saiConfig);
    }
#else
#endif

    if (direction)
    {
        SAI_TxSetBitClockRate(s_i2sBases[audioHandle->instance], config->srcClock_Hz, config->sampleRate_Hz,
                              config->bitWidth, channelNum);

        (void)EnableIRQ(txIrqNumber[audioHandle->instance]);

        SAI_TxEnableInterrupts(s_i2sBases[audioHandle->instance], kSAI_FIFOErrorInterruptEnable);
    }
    else
    {
        SAI_RxSetBitClockRate(s_i2sBases[audioHandle->instance], config->srcClock_Hz, config->sampleRate_Hz,
                              config->bitWidth, channelNum);

        (void)EnableIRQ(rxIrqNumber[audioHandle->instance]);

